
#include <stdio.h>

void main() {
    int a, b, c, d, e, f, g;

    a = 2 * 100 / 10;   	//a = 20 เพราะเท่ากับ (2 * 100) / 10 
    b = 100 / 10 * 2;       //b = 20 เพราะเท่ากับ (100 / 10) * 2
    c = 1 + 100 * 10;       //c = 1001 เพราะเท่ากับ 1 + (100 * 10)
    d = 2 * 100 / 10 + 30;  //d = 50 เพราะเท่ากับ ((2 * 100) / 10) + 30

    e = 5;
    f = 10;
    g = e++ * --f; 		        
    //g = 5 * (10 - 1) = 45	
    //เนื่องจาก  f++ มีลำดับความสำคัญต่ำสุด  
    //ดังนั้น การประมวลผลด้วย * และกำหนดค่าด้วย =  
    //จึงเกิดขึ้นก่อน y++


    printf(
        "\na = %d \nb = %d \nc = %d \nd = %d \ng = %d \n",
        a, b, c, d, g
    );

}
