#include <stdio.h>

void main() {
    //รูปแบบ (ความกว้าง) โดยแต่ละคอลัมน์เท่ากับ 15
    //คอลัมน์แรกให้ชิดซ้าย (ให้ความกว้างติดลบ)
    //ส่วนคอลัมน์ถัดไปให้ชิดขวา เพราะเป็นตัวลข
    char fm[200] = "\n%-15s%15s%15s";
    
    //หัวตาราง
    puts("\nProducts List:");
    printf(fm, "Item Name", "Price (Bath)", "Storage (GB)");
    printf("\n---------------------------------------------");

    //แถวที่ 1
    printf(fm, "iPhone",  "35,000", "256");

    //แถวที่ 2
    printf(fm, "iPad", "20,000", "128");

    //แถวที่ 3
    printf(fm, "MacBook", "80,000", "512");

    putchar('\n');
}