
#include <stdio.h>

void main() {
    //printf("\n(1)--30--(2)--50--(3)--60--");
    //printf("(4)--40--(5)--20--(6)\n");

    //int ticket_prices[] = {
    //    0, 30, 50, 60, 40, 20
    //};

    
    int ticket_prices[] = {[1]=30, 50, 60, 40, 20};

    int st1, st2;

    putchar('\n');

    //รับหมายเลขสถานีต้นทาง โดยให้วนลูป
    //จนกว่าผู้ใช้จะใส่ค่าที่อยู่ในช่วง 1 - 6
    while (1) {
        printf("enter station 1  (1 - 6) >>");
        scanf("%d", &st1);
        if (st1 >= 1 && st1 <= 6) {
            break;
        }
    }

    //รับหมายเลขสถานีปลายทาง โดยให้วนลูป
    //จนกว่าผู้ใช้จะใส่ค่าที่อยู่ในช่วง 1 - 6
    while (1) {
        printf("enter station 2  (1 - 6) >>");
        scanf("%d", &st2);
        if (st2 >= 1 && st2 <= 6) {
            break;
        }
    }

    printf("\nstation %d => %d", st1, st2);

    int tmp;

    //ถ้าใส้หมายเลขสถานีปลายทาง น้อยกว่า ต้นทาง
    //ต้นทาง = 5, ปลายทาง = 2
    //ก็ให้สลับหมายเลข เพื่อให้นำไปใช้กับลูป
    //ในขั้นตอนถัดไปได้เลย โดยไม่ต้องแยกคิด
    //เพราะถึงอย่างไร ค่าตั๋วไปหรือกลับจะเท่ากันอยู่แล้ว
    if (st2 < st1) {
        tmp = st1;
        st1 = st2;
        st2 = tmp;
    }

    //หาผลรวมตั๋วโดยสารระหว่างสถานีต้นทาง ถึง ปลายทาง
    int total = 0;
    for (int i = st1; i <= st2; i++) {
        total += ticket_prices[i];
    }
    
    printf("\ntotal ticket price: %d\n", total);   
}